package jc01_2020.lesson09.task06;

/*
 *
 * Создать и заполнить любыми числами два списка: обычный и связанный. Размер списков - 1 млн элементов.
 * В каждый список добавить 100_000 раз в нулевую позицию значение 0. Вывести в консоль длительности вставки 100_000
 * элементов для обычного и связанного списков.
 *
 * N.B. Поищите сами как засечь время.
 *
 */

import java.util.Scanner;

public class Application {

	public static void main(String[] args) {
		// Объявить список
		for (int i = 0; i < 1_000_000; i++) {
			// Заполнить список
		}
	}

}
