package jc01_2020.lesson12;

/*
 *
 * Создать карту вида "фамилия"-"имя" из 20 элементов. Длина и фамилии, и имени от 5 до 10 символов
 * 1) Вывести в консоль все значения карты
 * 2) переписать все значения как имя + фамилия
 * 3) оставить в стриме все имена, которые не длиннее 16 символов
 * 4) Вывести в консоль самое длинное имя
 *
 */

import java.util.HashMap;
import java.util.Map;

public class Task3 {
	public static void main(String[] args) {

		Map<String, String> map = new HashMap<>();
		// full the map

		String longName = null; // use map here: longName = map...

		System.out.println("longName = " + longName);

	}
}
